import React, { useState, useEffect } from "react";
import blog3 from "../img/blog3_1.png";
import gal from "../img/Galochka4.svg";
import LeftA from "../img/ArrowLeft.svg";
import RightA from "../img/ArrowRight.svg";
import "../index.css";

function App(props) {
  return (
    <main className="b1_wrap">
      <section className="this_choice">
        <span onClick={() => props.setThisPage(0)} className="golovna">
          Головна
        </span>{" "}
        {" › "}{" "}
        <span onClick={() => props.setThisPage(5)} className="golovna">
          Блог
        </span>
        {" › "}{" "}
        <span
          className="fixingBlogSpace"
          style={{ color: "rgb(255, 188, 87)" }}
        >
          Естетика. Чи підійдуть вам додаткові елементи?
        </span>
      </section>
      <h1>Естетика. Чи підійдуть вам додаткові елементи?</h1>
      <article className="b3_info">
        <img className="b1_Foto" src={blog3}></img>
        <div className="fixingParag">
          <div>
            <p>
              Естетика – це не просто наука, це важлива складова нашого
              сприйняття світу. Ця галузь займається вивченням краси та її
              впливу на людську свідомість, емоції та сприйняття. Вона дозволяє
              нам розуміти, чому ми відчуваємо себе привабливими до певних
              предметів, явищ або ідей, а також допомагає зрозуміти, які фактори
              визначають наші естетичні вподобання. Історія естетики багата та
              різноманітна. Від стародавнього Грецького світу, де філософи
              розглядали красу як прояв ідеального порядку, до сучасних
              досліджень у галузі психології та нейробіології, що розкривають
              таємниці сприйняття краси людиною. Естетика відображається у всіх
              аспектах життя – від мистецтва до архітектури, від моди до
              ландшафтного дизайну.
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              У світі мистецтва, естетика є основою творчості. Вона визначає
              стандарти краси та вираження почуттів через образи, музику, танець
              та інші форми виразності. Кожен митець намагається відобразити
              світ через призму власних естетичних переживань, створюючи твори,
              які надихають, захоплюють та залишаються в пам'яті.
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              У сфері дизайну та архітектури, естетика впливає на наше оточення
              та комфорт. Вона визначає форму, кольори, текстури та стиль нашого
              середовища, створюючи гармонію та розкош у нашому повсякденному
              житті. Чи то сучасний будинок, ергономічний меблі або витончений
              декор – естетика допомагає нам створити простір, де ми почуваємося
              комфортно та затишно.
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              У сфері моди, естетика визначає тенденції та стандарти краси. Від
              вибору кольорів та тканин до форм та ліній – кожен дизайнер
              намагається створити одяг, який відображає сучасність та
              індивідуальність, що відповідає естетичним уподобанням споживачів.
            </p>
          </div>
          <div>
            <p>
              В кінці кінців, естетика нагадує нам про красу у всьому навколо.
              Від природних пейзажів до абстрактного мистецтва, від простих форм
              до складних конструкцій – кожен об'єкт, ідея чи враження може бути
              красивим у своєму унікальному способі. У світі естетики краса
              знаходиться у всьому, що нас оточує. Вона відображається у нашому
              сприйнятті світу та допомагає нам зрозуміти себе та інших навколо.
              Тому важливо підтримувати та розвивати естетичні цінності у
              суспільстві, надаючи кожному можливість насолоджуватися красою у
              всії її формах.
            </p>
          </div>
        </div>
      </article>
      <div className="b_Buttons">
        {props.isPage !== 101 ? (
          <button
            className="b1_isActive"
            onClick={() => props.setThisPage(props.isPage - 1)}
          >
            <img src={LeftA}></img>Попередня стаття
          </button>
        ) : (
          <button className="b1_noActive">
            <img src={LeftA}></img>Попередня стаття
          </button>
        )}
        {props.isPage !== 106 ? (
          <button
            className="b1_isActive"
            onClick={() => props.setThisPage(props.isPage + 1)}
          >
            Наступна стаття <img src={RightA}></img>
          </button>
        ) : (
          <button className="b1_noActive">
            Наступна стаття<img src={RightA}></img>
          </button>
        )}
      </div>
    </main>
  );
}

export default App;
