import React, { useState, useEffect } from "react";
import blog1 from "../img/blog1.png";
import gal from "../img/Galochka4.svg";
import LeftA from "../img/ArrowLeft.svg";
import RightA from "../img/ArrowRight.svg";
import "../index.css";

function App(props) {
  return (
    <main className="b1_wrap">
      <section className="this_choice">
        <span onClick={() => props.setThisPage(0)} className="golovna">
          Головна
        </span>{" "}
        {" › "}{" "}
        <span onClick={() => props.setThisPage(0)} className="golovna">
          Блог
        </span>
        {" › "}{" "}
        <span
          className="fixingBlogSpace"
          style={{ color: "rgb(255, 188, 87)" }}
        >
          Новий дизайн. Чи підійде вам новий стиль?
        </span>
      </section>
      <h1>Новий дизайн. Чи підійде вам новий стиль?</h1>
      <article className="b1_info">
        <img className="b1_Foto" src={blog1}></img>
        <div className="fixingParag">
          <div>
            <p>
              У світі, який постійно змінюється, один з ключових аспектів, що
              впливає на успіх будь-якого бізнесу, - це його здатність
              адаптуватися до нових тенденцій і вимог ринку. Один із способів,
              яким це можна зробити, - це оновлення дизайну. Але чи підійде вам
              новий стиль?
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              Перш за все, важливо враховувати вашу цільову аудиторію. Новий
              дизайн повинен відповідати їхнім потребам і побажанням. Наприклад,
              якщо ви працюєте в галузі моди, ваш дизайн повинен бути сучасним і
              стильним, щоб привертати увагу молодіжного сегменту ринку. З
              іншого боку, якщо ваш бізнес спрямований на людей похилого віку,
              дизайн повинен бути більш консервативним і лаконічним.
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              Далі, ви повинні враховувати специфіку вашого бренду. Якщо у вас є
              чітко визначені корпоративні кольори і стиль, новий дизайн повинен
              гармоніювати з ними. Наприклад, якщо ваш бренд відомий своєю
              стриманістю і мінімалізмом, раптове переходження до яскравих і
              яскравих кольорів може призвести до розчарування вашої аудиторії.
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p>
              Не менш важливо враховувати індустрійні тенденції. Деякі
              дизайнерські рішення можуть бути популярними в певний період, але
              стати застарілими через кілька місяців. Тому важливо слідкувати за
              останніми трендами і адаптувати ваш дизайн відповідно до них.
              Нарешті, не забувайте про власні уподобання та інтуїцію. Хоча
              важливо бути відкритим до нових ідей і трендів, ви також повинні
              залишатися вірними собі і своєму бренду. Якщо новий дизайн не
              відображає вашої власної особистості і стилю, його впровадження
              може виявитися неефективним.
            </p>
          </div>
          <div>
            <p>
              Отже, чи підійде вам новий стиль? Відповідь на це питання залежить
              від численних факторів, включаючи вашу цільову аудиторію,
              специфіку вашого бренду, індустрійні тенденції та власні
              уподобання. Ретельне вивчення цих аспектів допоможе вам зробити
              обдуманий вибір і вибрати дизайн, який найкраще підходить для
              вашого бізнесу.
            </p>
          </div>
        </div>
      </article>
      <div className="b_Buttons">
        <button>
          <img src={LeftA}></img>Попередня стаття
        </button>
        <button>
          Попередня стаття <img src={RightA}></img>
        </button>
      </div>
    </main>
  );
}

export default App;
