import React, { useState, useEffect } from "react";
import blog6 from "../img/blog6_2.png";
import gal from "../img/Galochka4.svg";
import LeftA from "../img/ArrowLeft.svg";
import RightA from "../img/ArrowRight.svg";
import "../index.css";

function App(props) {
  return (
    <main className="b1_wrap">
      <section className="this_choice">
        <span onClick={() => props.setThisPage(0)} className="golovna">
          Головна
        </span>{" "}
        {" › "}{" "}
        <span onClick={() => props.setThisPage(5)} className="golovna">
          Блог
        </span>
        {" › "}{" "}
        <span
          className="fixingBlogSpace"
          style={{ color: "rgb(255, 188, 87)" }}
        >
          Оформлення вітальні. Які м'які меблі краще вибрати?
        </span>
      </section>
      <h1>Оформлення вітальні. Які м'які меблі краще вибрати?</h1>
      <article className="b3_info">
        <img className="b1_Foto" src={blog6}></img>
        <div className="fixingParag">
          <div>
            <p>
              Вибір м'яких меблів для вітальні - це ключовий етап у створенні
              затишного та комфортного простору для сім'ї та гостей. Однак,
              перед тим як зробити вибір, важливо врахувати декілька аспектів,
              що визначатимуть зручність, стиль та функціональність меблів. Ось
              деякі поради щодо вибору м'яких меблів для вашої вітальні:
              <br />
              <br />
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p style={{ fontWeight: "600" }}>Диван:</p>
            <p>
              <br />
              Розмір і форма: Оберіть диван, який відповідає розміру вашої
              вітальні і має підходящу форму. Врахуйте геометрію кімнати та
              розміщення інших меблів. <br />
              Комфортність: Переконайтеся, що диван забезпечує достатню
              підтримку спини і має зручне сидіння. Важливо випробувати його
              перед покупкою.
              <br /> Матеріал: Виберіть високоякісний та довговічний матеріал
              для дивана, такий як натуральна шкіра або тканина відповідного
              складу. Врахуйте практичність і стиль матеріалу.
              <br />
              <br />
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p style={{ fontWeight: "600" }}>Крісла:</p>
            <p>
              <br />
              Кількість: Розгляньте кількість крісел, які потрібні для вашої
              вітальні в залежності від розміру сім'ї та частоти гостей. <br />
              Стиль: Виберіть крісла, які відповідають стилю дивана та
              загальному інтер'єру кімнати. Розгляньте можливість вибору крісел
              із схожими дизайнерськими елементами.
              <br /> Комфорт: Переконайтеся, що крісла мають зручне сидіння та
              підтримку для спини. Вони повинні бути приємними для довгих розмов
              або перегляду фільмів.
              <br />
              <br />
            </p>
          </div>
          <div>
            <img src={gal}></img>
            <p style={{ fontWeight: "600" }}>Пуфи:</p>
            <p>
              Функціональність: Розгляньте можливість додавання пуфів до вашої
              вітальні. Вони можуть служити як додаткові сидіння. <br /> Стиль:
              Виберіть пуфи, які доповнюють стиль основних меблів та створюють
              гармонійний інтер'єр. <br /> Матеріали: Врахуйте матеріали, з яких
              виготовлені пуфи, і їх відповідність вашим потребам та стилю
              кімнати.
              <br />
              <br />
            </p>
          </div>
          <div>
            <p>
              Вибір м'яких меблів для вітальні - це індивідуальний процес, що
              вимагає уваги до деталей та врахування ваших потреб та вподобань.
              Пам'ятайте про комфорт, стиль і функціональність меблів, і ваша
              вітальня стане улюбленим місцем для відпочинку та спілкування з
              родиною та друзями.
            </p>
          </div>
        </div>
      </article>
      <div className="b_Buttons">
        {props.isPage !== 101 ? (
          <button
            className="b1_isActive"
            onClick={() => props.setThisPage(props.isPage - 1)}
          >
            <img src={LeftA}></img>Попередня стаття
          </button>
        ) : (
          <button className="b1_noActive">
            <img src={LeftA}></img>Попередня стаття
          </button>
        )}
        {props.isPage !== 106 ? (
          <button
            className="b1_isActive"
            onClick={() => props.setThisPage(props.isPage + 1)}
          >
            Наступна стаття <img src={RightA}></img>
          </button>
        ) : (
          <button className="b1_noActive">
            Наступна стаття<img src={RightA}></img>
          </button>
        )}
      </div>
    </main>
  );
}

export default App;
